{
    "title":  "Szenarien",
    "intro": "Verschiedene Situationen, die es zu bedenken gibt",
    "examples": [
        {
            "title": "Was ist ein Deadlock?",
            "identifier": "deadlock",
            "main": "Ein Deadlock entsteht, wenn zwei Prozesse sich 'verklemmen' indem sie auf das Freigeben bestimmter Ressourcen warten, die vom anderen zu diesem Zeitpunkt benutzt werden.",
            "example": "Ein kleines Beispiel: Wir sind auf einem Parkplatz. Ein Auto steht auf einem Parkplatz und möchte rückwärts aus der Parklücke fahren. Hinter ihm steht jedoch schon ein weiteres Auto, dass in den dort freiwerdenden Parkplatz einfahren möchte. Also blockiert das wartende Auto das ausparkende Auto und das ausparkende Auto das Wartende.",
            "outro": "Gibt's nich"
        },
        {
            "title": "Was ist ein Livelock?",
            "identifier": "lifelock",
            "main": "Ähnlich wie beim Deadlock kommen wir nicht mehr zu unserem eigentlichen Ziel. Jedoch wird beim Livelock nicht in der 'Warteposititon' verharrt, sondern es findet ein stätiges wechseln der Zustände statt. ",
            "example": "Jip's auch nisch",
            "outro": "Nope"
        },
        {
            "title": "Was ist eine Race Condititon?",
            "identifier": "race_condition",
            "main": "Eine Race Condititon entsteht, wenn zwei oder mehr Threads von zeitlichen ablaufen gegenseitig abhängig sind. Die Threads laufen ja nicht praktisch 100% parallel, sondern ihnen werden über verschiedene Schedular bestimmte Rechenzeiträume zugeteilt. Nun kann es sein, dass aber unser Thread1, der auf das Ergebnis von Thread2 angewiesen ist, zwei mal hintereinander zugeteilt wird, Thread2 dagegen noch nicht weiter laufen konnte. So kann es leicht zu Fehlern kommen.",
            "example": "Wenn du ein Wettrennen gegen deine Mudda machst und sie an Start und Ziel gleichzeitig ist",
            "outro": "Nope"
        },
        {
            "title": "Was ist Synchronisation",
            "identifier": "synchronization",
            "main": "Synchronisation ist sozusagen die Lösung der Race Condition. Es ist Teil des zuvor schon angesprochenen Schedulars, nur dass die Synchronisation die Abhängigkeiten der verschiedene Prozesse voneinander beachtet um die effizienteste Zuteilung zu ermöglichen.",
            "example": "",
            "outro": ""
        },
        {
          "title": "Was ist das Raucherproblem",
          "identifier": "smokers_problem",
          "main": "Das Raucherproblem beschriebt die Schwierigkeit der richtigen Verteilung der Ressourcen zwischen den verscheidenen Prozessen.",
          "example": "Hier ein Beispiel: Wir haben 3 Raucher in einem Raum und es gibt nur einen Tisch. Jeder Raucher kann nur, wenn er an diesem Tisch sitzt seine Zigarette drehen und rauchen. Raucher 1 hat unbegrenzt Tabak, Raucher 2 unbegrenzt Papier und Raucher 3 unbegrenzt Feuer. Der HÄndler hat von allem immer nur begrenzte Mengen und bekommt in unregelmÄßigen AbstÄnden Nachschub. Er legt jedoch immer nur 2 Zutaten auf den Tisch. Wenn für einen Raucher durch die Zugabe des HÄndlers alle Teile vorhanden sind, setzt er sich an den Tisch und raucht so lange, bis eine Ressource aufgebraucht ist. Es kann jedoch immer nur ein Raucher am Tisch sitzen. Wenn der HÄndler nun also ein Feuerzeug und Papier hinlegt, kann der Raucher, der unbegrenzt Tabak hat, sich an den Tisch setzen und so lange Rauchen bis ihm entweder das Papier ausgeht oder das Feuerzeug leer ist. Auch wenn der HÄndler zwischendurch wieder ein bisschen Tabak bekommen hat, den ein anderer Rauchen benötigen würde, kann dieser nicht mit dem Rauchen beginnen, da der Tisch noch belegt ist, bis die Zigarette des ersten Rauchers aufgebraucht ist.",
          "outro": "Es geht hier also um das Problem des Wartens auf einen Prozess, damit andere Prozesse auch an die Reihe kommen können."
        },
        {
          "title": "Was ist das Philosophenproblem?",
          "identifier": "philosophers_problem",
          "main": "Das Problem beschreibt die Schwierigkeit der Verteilung der Rechenzeiten, sodass jeder Prozess auch in einer angemessenen Zeit eingeteilt wird.",
          "example": "Gehen wir davon aus, es sÄßen 5 Philosophen um einen Runden Tisch herum. Jeder hat einen Teller mti Essen vor sich. Dabei benötigen jeder von ihnen zum Essen 2 StÄbchen. Jeder von ihnen hat jedoch nur ein StÄbchen bekommen. Wenn jemand essen will, dann darf er sich nur das StÄbchen links und das StÄbchen rechts von ihm nehmen. Wenn ein Philosoph hungrig wird, nimmt er sich die StÄbchen und fÄngt an zu essen, sobald er fertig ist, legt er sie wieder zurück. Wenn immer nur einzelne Philosophen essen, dann funktioniert das System gut. Wenn jedoch alle gleichzeitig essen wollen kann die Situation entsehen, dass ein Philosoph an kein StÄbchen mehr herankommt und auch nie an eins herankommen wird, da die StÄbchen immer zwischen den anderen hin und her gegeben werden. Er muss also verhungern.",
          "outro": "Jeder Philosoph ist in Wirklichkeit ein Prozess und wenn er verhungert, dann kommt er nicht zu seiner Rechenzeit und kann seine Aufgabe somit niemals erfüllen."
        }
    ]
}
